//24 Напишите программу, которая принимает на вход число A
// и выдаёт сумму чисел от 1 до A
// a = 5
// sum = 1 + 2 + 3 + 4 + 5

Console.Clear();
Console.Write("Введите число ");
int a = int.Parse(Console.ReadLine()!);

int GetSum(int limit){// создаём функцию, котороя возвращает целое число и до какого момента считать наприменр 5
  int sum = 0;
  for (int i = 1; i <= limit; i++)// создаём цикл который перебирает все числа от 1 до числа которое например задал пользователь (5)
  {
    sum += i;// прибаляем каждое число от 1 до лимита (5) 
  }
  return sum;// возвращаем посчитанную сумму
}

Console.WriteLine($"Сумма от 1 до {a} равна {GetSum(a)}");// выводим в консоль где GetSum(a)- это функия с аргументом а, которое в этом методе посчитано