// **Задача 40:**Напишите программу,
// которая принимает на вход три числа и проверяет, может ли
// существовать треугольник с сторонами такой длины.


// ❗ **Теорема о неравенстве треугольника:
// **каждая сторона треугольника меньше суммы двух других сторон.

Console.Clear();

Console.Write("Введите стороны треугольника через пробел: ");

string[] st = Console.ReadLine()!.Split(' ', StringSplitOptions.RemoveEmptyEntries); //считал строку и разделил её на массив

int a = int.Parse(st[0]), b = int.Parse(st[1]), c = int.Parse(st[2]);// создали переменные где складываем индексы массива

bool IsTriangle(int a1, int b1, int c1)// создём функцию которая возвращает либо true либо false
{
  return ((a1 + b1) > c1) && ((a1 + c1) > b1) && ((b1 + c1) > a1);// делаем проверку на неравенство сторон и возращаем 
}

if (IsTriangle(a, b, c))// проверяем, если результат работы функции будет 
{
  Console.WriteLine($"Треугольник со сторнами {a}, {b}, {c} может существовать");// true
}else
{
  Console.WriteLine($"Треугольник со сторнами {a}, {b}, {c} не может существовать");// false
}
