//28 Напишите программу, которая принимает на вход число N 
//и выдаёт произведение чисел от 1 до N.

//4-> 24
//5-> 120 == 1 * 2 * 3 * 4 * 5

Console.Clear();
Console.Write("Ввдите число: ");
int num = int.Parse(Console.ReadLine()!);

int Factorial(int n){
  int result = 1;// переменной задаём значение 1 потому что если задать 0, то потом при умножении на 0 результат всегда будет 0
  for (int i = 2; i <= n; i++)// счётчик i=2, чтобы лишний раз не прогонять цикл, потому что если заданное число меньше 2, то результат и так 1 например n=1 , сравниваем 2 <= 1, нет, то сразу выводим результат
  {
    result *= i;// пример result = 6 * 4 = 24 каждый раз заданное число умножается на предыдущее 
  }
  return result;// возвращаем результат 
}
Console.WriteLine($"Произведение {num} -> {Factorial(num)}");